; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v13)
             (pred_9 ?v5 ?v10)
             (pred_5 ?v4 ?v10)
             (pred_6 ?v12 ?v4 )
	     (pred_10 ?v4)
             (pred_4 ?v1)
             (pred_12 ?v5)
             (pred_7 ?v10)
             (pred_11 ?v4)
             (pred_8 ?v5)
             (pred_2 ?v4)
             (pred_1 ))



(:action op_1
:parameters (?v6 ?v11 ?v8 ?v2)
:precondition (and (pred_4 ?v6) (pred_4 ?v11) (pred_12 ?v8) (pred_7 ?v2)
          (pred_3 ?v6 ?v11) (pred_9 ?v8 ?v2)
                   (pred_5 ?v11 ?v2) (pred_10 ?v6) 
                   (pred_11 ?v11) (pred_8 ?v8))
:effect (and  (pred_2 ?v11) (not (pred_11 ?v11))))


(:action op_2
:parameters (?v6 ?v7)
:precondition (and (pred_4 ?v6) (pred_4 ?v7)
               (pred_10 ?v6) (pred_3 ?v6 ?v7) (pred_2 ?v7))
:effect (and (pred_10 ?v7) (not (pred_10 ?v6))))

(:action op_4
:parameters (?v6 ?v8)
:precondition (and (pred_4 ?v6) (pred_12 ?v8) 
                  (pred_10 ?v6) (pred_6 ?v8 ?v6) (pred_1 ))
:effect (and (pred_8 ?v8)
   (not (pred_6 ?v8 ?v6)) (not (pred_1 ))))


(:action op_3
:parameters (?v6 ?v3 ?v9)
:precondition (and (pred_4 ?v6) (pred_12 ?v3) (pred_12 ?v9)
                  (pred_10 ?v6) (pred_8 ?v9) (pred_6 ?v3 ?v6))
:effect (and (pred_8 ?v3) (pred_6 ?v9 ?v6)
        (not (pred_8 ?v9)) (not (pred_6 ?v3 ?v6))))

(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_4 ?v6) (pred_12 ?v8) 
                  (pred_10 ?v6) (pred_8 ?v8))
:effect (and (pred_1 ) (pred_6 ?v8 ?v6) (not (pred_8 ?v8)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_20 obj_05 obj_06 obj_09 obj_17 obj_08 obj_22 obj_07 obj_15 obj_12 obj_21 obj_01 obj_04 obj_02 obj_14
    obj_13 obj_19 obj_16
    obj_03 obj_11 obj_18
    )

    (:init
       (pred_1)

       (pred_4 obj_10)
       (pred_4 obj_20)
       (pred_4 obj_05)
       (pred_4 obj_06)
       (pred_4 obj_09)
       (pred_4 obj_17)
       (pred_4 obj_08)
       (pred_4 obj_22)
       (pred_4 obj_07)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_21)
       (pred_4 obj_01)
       (pred_4 obj_04)
       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_7 obj_13)
       (pred_7 obj_19)
       (pred_7 obj_16)
       (pred_12 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_18)

       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_20 obj_17)
       (pred_3 obj_20 obj_05)
       (pred_3 obj_20 obj_10)
       (pred_3 obj_05 obj_08)
       (pred_3 obj_05 obj_06)
       (pred_3 obj_05 obj_20)
       (pred_3 obj_06 obj_22)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_17)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_17 obj_15)
       (pred_3 obj_17 obj_08)
       (pred_3 obj_17 obj_20)
       (pred_3 obj_17 obj_09)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_08 obj_05)
       (pred_3 obj_08 obj_17)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_22 obj_06)
       (pred_3 obj_22 obj_08)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_15)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_15 obj_04)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_15 obj_07)
       (pred_3 obj_12 obj_02)
       (pred_3 obj_12 obj_21)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_21 obj_14)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_21 obj_12)
       (pred_3 obj_01 obj_04)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_15)
       (pred_3 obj_04 obj_01)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_12)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_14 obj_21)
       (pred_3 obj_14 obj_02)
       (pred_11 obj_22)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_5  obj_22 obj_13)
       (pred_5  obj_08 obj_19)
       (pred_5  obj_07 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_05)
       (pred_2 obj_06)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_15)
       (pred_2 obj_12)
       (pred_2 obj_21)
       (pred_2 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_14)

       (pred_9  obj_03 obj_13)
       (pred_9  obj_11 obj_19)
       (pred_9  obj_18 obj_16)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_18 obj_14)
       (pred_10 obj_21)
    )

    (:goal (and
       (pred_6 obj_18 obj_04)
    ))
(:constraints
  (always (not (pred_10 obj_02)))
)
)

; plan
1. (op_2 obj_21 obj_14)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_14)
   goals met: 0 of 1
2. (op_4 obj_14 obj_18)
   deleted: (pred_6 obj_18 obj_14) (pred_1)
   added: (pred_8 obj_18)
   goals met: 0 of 1
3. (op_2 obj_14 obj_21)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_21)
   goals met: 0 of 1
4. (op_2 obj_21 obj_12)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_12)
   goals met: 0 of 1
5. (op_2 obj_12 obj_15)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_15)
   goals met: 0 of 1
6. (op_2 obj_15 obj_04)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_04)
   goals met: 0 of 1
7. (op_5 obj_04 obj_18)
   deleted: (pred_8 obj_18)
   added: (pred_1) (pred_6 obj_18 obj_04)
   goals met: 1 of 1
